<template>
    <div class="container mx-auto px-4 py-8">
      <h1 class="text-3xl font-bold mb-6">Условия использования</h1>
      
      <div class="prose max-w-none">
        <p class="mb-4">Последнее обновление: 01.11.2023</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">1. Принятие условий</h2>
        <p class="mb-4">Добро пожаловать на сайт METRAGE.PRO. Используя наш сайт, вы соглашаетесь соблюдать и быть связанными данными Условиями использования. Если вы не согласны с любым из этих условий, пожалуйста, не используйте наш сайт.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">2. Использование сайта</h2>
        <p class="mb-4">Вы соглашаетесь использовать сайт только в законных целях и таким образом, чтобы не нарушать права других лиц и не ограничивать или препятствовать использованию и пользованию сайтом другими лицами.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">3. Услуги</h2>
        <p class="mb-4">Наша компания предоставляет услуги по профессиональным замерам помещений. Оформление заказа через форму на сайте является офертой на заключение договора на оказание услуг.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">4. Оплата и условия</h2>
        <p class="mb-4">Оплата услуг производится согласно тарифам, указанным на нашем сайте. Мы оставляем за собой право изменять цены на услуги в любое время, но эти изменения не будут влиять на заказы, которые были подтверждены до изменения цен.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">5. Интеллектуальная собственность</h2>
        <p class="mb-4">Весь контент, представленный на сайте, включая текст, графику, логотипы, изображения, аудио, видео и программное обеспечение, является собственностью нашей компании или наших поставщиков контента и защищен законами об авторском праве.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">6. Ограничение ответственности</h2>
        <p class="mb-4">Наша компания не несет ответственности за любые прямые, косвенные, случайные, специальные или косвенные убытки, возникшие в результате использования или невозможности использования наших услуг.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">7. Изменения в условиях</h2>
        <p class="mb-4">Мы оставляем за собой право изменять эти условия в любое время. Любые изменения вступят в силу сразу после публикации пересмотренных условий на сайте.</p>
        
        <h2 class="text-2xl font-semibold mt-8 mb-4">8. Контактная информация</h2>
        <p class="mb-4">Если у вас есть вопросы об этих Условиях использования, пожалуйста, свяжитесь с нами по адресу: <a href="mailto:dronikov93@gmail.com" class="text-blue-600 hover:underline">dronikov93@gmail.com</a></p>
      </div>
    </div>
  </template>